package com.yondervision.mi.test.wangting1qi;

import com.yondervision.mi.common.EncryptionByMD5;
import com.yondervision.mi.test.AesTest;
import com.yondervision.mi.util.security.RSASignature;

import java.io.BufferedReader;
import java.io.DataOutputStream;
import java.io.InputStreamReader;
import java.net.HttpURLConnection;
import java.net.URL;
import java.net.UnknownHostException;
//不动产房屋登记信息查询
public class HttpSend5907appapi00113 {
	public static final String POST_URL = "http://61.153.144.77:7006/YBMAPZH/";
//	public static final String POST_URL = "http://172.16.10.96:7001/YBMAPZH/";
	private static final String appKey_V = "b5b1c6938e5d0cef72457bd788ffdef0";
	private static final String appId_V = "yondervisionwebservice40";
	private static final String clientIp_V="172.10.0.1";
	
	public static String httpURLConnectionPOST5907(
			String powerMatters,
			String subPowerMatters,
			String materialName,
			String clientusercid,
			String qlrzjh,
			String computername,
			String cxfw,
			String clientusername,
			String qlrmc,
			String zl
			) {
		try {
			
			long starTime=System.currentTimeMillis();
			URL url = new URL(POST_URL + "appapi00113.json");
			HttpURLConnection connection = (HttpURLConnection) url.openConnection();
			connection.setDoOutput(true);
			connection.setDoInput(true);
			connection.setRequestMethod("POST");
			connection.setUseCaches(false);
			connection.setInstanceFollowRedirects(true);
			connection.addRequestProperty("headpara","fullPara,centerId,channel");
			String userId = "330219197910223297";

			AesTest aes = null;
			try {
				aes = new AesTest();
			} catch (Exception e) {
				e.printStackTrace();
			}

		 String Para ="userId="+ clientusercid+ "&usertype=10&deviceType=3&deviceToken=&currenVersion=1.0&buzType=5907&appid="
						+ appId_V+ "&appkey="+ appKey_V+ "&appToken=&clientIp="+clientIp_V+"&clientMAC=E8:39:35:A7:AC:58&brcCode=05740008&tranDate=2017-09-19&channelSeq="
						+ "&powerMatters="+powerMatters
						+ "&subPowerMatters="+subPowerMatters
						+ "&materialName="+materialName
						+"&clientusercid="+clientusercid
						+ "&qlrzjh="+qlrzjh
						+ "&computername="+computername
						+ "&cxfw="+cxfw
						+ "&clientusername="+ clientusername
						+ "&qlrmc="+ qlrmc
						+ "&zl="+ zl;
			System.out.println("本地参数:" + Para);
			 String fullPara =aes.encrypt(Para.getBytes("UTF-8"));
			 // 用于数字签名/**/
			String parm ="fullPara="+fullPara+"&centerId=00057400&channel=40";			
			// 用于发送http报文
			String parm1 ="fullPara="+ fullPara.replace("+", "%2B")+ "&AESFlag=1&centerId=00057400&channel=40";
			//System.out.println("本地参数:" + parm);
			//System.out.println("传递参数:" + parm1);
			connection.addRequestProperty("headparaMD5", RSASignature.sign(EncryptionByMD5.getMD5(parm.getBytes()),RSASignature.RSA_PRIVATE));
			connection.setRequestProperty("Content-Type","application/x-www-form-urlencoded;charset=utf-8");
			connection.connect();
			DataOutputStream dataout = new DataOutputStream(connection.getOutputStream());
			dataout.writeBytes(parm1);
			dataout.flush();
			dataout.close();
			BufferedReader bf = new BufferedReader(new InputStreamReader(connection.getInputStream(), "UTF-8"));
			String line;
			StringBuilder sb = new StringBuilder();
			while ((line = bf.readLine()) != null) {
				sb.append(line).append(System.getProperty("line.separator"));
			} 
			bf.close();
			connection.disconnect(); 
			String result=aes.decrypt(sb.toString());
			System.out.println(result);
			long endTime=System.currentTimeMillis();
			long Time=endTime-starTime;
			System.out.println("请求大数据平台耗时"+Time+"毫秒");
			return result;
		} catch (Exception e) {
			e.printStackTrace();
			return "";
		}
	}

	public static void main(String[] args) throws UnknownHostException {
		for (int i = 0; i < 1; i++) {
/*
励文君	330225198807122887  	103室
沃碧光	330206198108070310  	10幢111室
马君萍	330227197903232742  	1104
斯昊辉	33028319821125003X  	11幢25
章小兵	362226197710051233  	1302
查辉旺	362302197504160070  	13幢202室
周志刚	33022219350922797X  	144弄
柴琪威	330225198702211576 	    1502室
伊波	    330225198609114819  	1401
*/
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330726198810170330","330726198810170330","GJJ","","张鹏程","张鹏程","78弄11");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33028219870927004X","33028219870927004X","GJJ","","陈意","陈意","2303");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","430404197105051162","430404197105051162","GJJ","","李新香","李新香","15号402");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227197905264422","330227197905264422","GJJ","","楼卓微","励文君","2202");

			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330203196704060014","330203196704060014","GJJ","","倪爱良","倪爱良","17幢58号");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330225198807122887","330225198807122887","GJJ","","励文君","励文君","103室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330206198108070310","330206198108070310","GJJ","","沃碧光","沃碧光","10幢111室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227197903232742","330227197903232742","GJJ","","马君萍","马君萍","1104");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33028319821125003001X","33028319821125003X","GJJ","","斯昊辉","斯昊辉","11幢25");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","362226197710051233","362226197710051233","GJJ","","章小兵","章小兵","1302");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","362302197504160070","362302197504160070","GJJ","","查辉旺","查辉旺","13幢202室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33022219350922797X","33022219350922797X","GJJ","","周志刚","周志刚","144弄");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330225198702211576","330225198702211576","GJJ","","柴琪威","柴琪威","1502室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330225198609114819","330225198609114819","GJJ","","伊波","伊波","1401");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330226198611075608","330226198611075608","GJJ","","章秋霞","章秋霞","郁金花园");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330211198810140041","330211198810140041","GJJ","","叶婧妍","叶婧妍","永平西路");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","230502198603071377","230502198603071377","GJJ","","史明亮","史明亮","27幢503室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330206198108070310","330206198108070310","GJJ","","沃碧光","沃碧光","10幢111室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","331023198405282228","331023198405282228","GJJ","","余海燕","余海燕","12号202室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","340504199511240623","340504199511240623","GJJ","","严丽","严丽","1205室");


			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330206198305241721","330206198305241721","GJJ","","张晓静","张晓静","天成家园20幢86号207");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330225198811260035","330225198811260035","GJJ","","励哲","励哲","紫玉台花苑15幢31号408");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","431102198508068360","431102198508068360","GJJ","","周叶","周叶","新园路118弄93号503，阁03");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","342201198510243664","342201198510243664","GJJ","","马圆圆","马圆圆","民安路625弄86号304");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","510824198812263799","510824198812263799","GJJ","","马强","马强","建业街285弄77号204");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330922198610130030","330922198610130030","GJJ","","陈浩","陈浩","宁波市鄞州区中河街道东湖馨园6幢13号402室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33028119900715742X","33028119900715742X","GJJ","","徐琳琳","徐琳琳","宁波市鄞州区下应街道海创家园77幢180号1002室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330204196908121014","330204196908121014","GJJ","","桑晓彪","桑晓彪","环城北路西段708弄83号6幢01");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33090319900602064X","33090319900602064X","GJJ","","徐佳艳","徐佳艳","广贤路1071号1606");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","340826199010028733","340826199010028733","GJJ","","徐智","徐智","奥林花园1幢14号407");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330205197512122716","330205197512122716","GJJ","","张澄波","张澄波","姚畔湾3幢9号304");
			/*
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","331082198702102545","331082198702102545","GJJ","","吕娇苹","吕娇苹","宁波市海曙区石碶街道汽运小区3幢303室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","332502198109131923","332502198109131923","GJJ","","蔡月香","蔡月香","新舟路123弄6号401");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330205197212070627","330205197212070627","GJJ","","梁莉萍","梁莉萍","宁波市海曙区古林镇藕池新村通达开发29幢504室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227199007298216","330227199007298216","GJJ","","徐文元","徐文元","宁波市海曙区集士港镇紫御铭园12幢25号1002室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330204199501295016","330204199501295016","GJJ","","王迪","王迪","宁波市鄞州区邱隘镇汇悦湾花苑4幢11号2605室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330219197007084470","330219197007084470","GJJ","","王云波","王云波","怡北街33号505");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227198802287546","330227198802287546","GJJ","","洪丽娜","洪丽娜","宁波市海曙区高桥镇河风丽庭39号306室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33022619851031127X","33022619851031127X","GJJ","","张侠","张侠","宁波市鄞州区潘火街道潘火桥小区9幢24号104室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330921197110225016","330921197110225016","GJJ","","夏四海","夏四海","宁波市鄞州区中河街道公馆6号1幢1单元2108室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330283198510110061","330283198510110061","GJJ","","王敏倩","王敏倩","九五花园9幢24号706");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","332626196812203017","332626196812203017","GJJ","","柯桂云","柯桂云","百丈东路762号603");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330282198203141515","330282198203141515","GJJ","","祝琦","祝琦","陆嘉家园15幢58号208");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330203197802172460","330203197802172460","GJJ","","李宇","李宇","白杨街16弄14号206");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330225198705250327","330225198705250327","GJJ","","肖语","肖语","兴宁巷44号1902");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330203198511073619","330203198511073619","GJJ","","胡宁","胡宁","常青路98弄88号204");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330721198803011946","330721198803011946","GJJ","","曹莉","曹莉","东御花苑1号2803");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330624197410297743","330624197410297743","GJJ","","董小英","董小英","宁波市鄞州区钟公庙街道长丰景苑3幢3号703室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227198904015357","330227198904015357","GJJ","","马骏","马骏","宁波市鄞州区中河街道小城花园14幢32号1301室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330204196205262021","330204196205262021","GJJ","","应海绒","应海绒","清水桥路399弄4号903");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330204198912175030","330204198912175030","GJJ","","陈迪","陈迪","莘香雅苑15幢54号202");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","340827197711180313","340827197711180313","GJJ","","阳忠林","阳忠林","宁波市鄞州区钟公庙街道长丰景苑7幢10号1601室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330681198703229025","330681198703229025","GJJ","","陈佳丽","陈佳丽","通途路410号303");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","620104198912210012","620104198912210012","GJJ","","王一霏","王一霏","宁波市海曙区古林镇西湖花园25幢71号1502室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330206199012093117","330206199012093117","GJJ","","乐可星","乐可星","丽园北路75弄40号205");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330282198812104998","330282198812104998","GJJ","","杨浩巍","杨浩巍","古塘街道吉祥新村16号楼504室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330282198810244698","330282198810244698","GJJ","","郁建辉","郁建辉","镇海区骆驼街道大河路16号盛世华庭9号1003室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227197606101615","330227197606101615","GJJ","","余军","余军","镇海区招宝山街道沿江东路34号302室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","360222198605110032","360222198605110032","GJJ","","鲍鑫","鲍鑫","宁馨园5幢87号503");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227197511032012","330227197511032012","GJJ","","邱建军","邱建军","宁波市鄞州区中河街道大朱家新村28幢205室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330205198404083320","330205198404083320","GJJ","","张胜男","张胜男","逸嘉新园3幢10号405");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","510811198708025115","510811198708025115","GJJ","","何杰","何杰","宁波市鄞州区姜山镇都市华庭16幢90号612室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330881199110051917","330881199110051917","GJJ","","何忻恺","何忻恺","宁波市海曙区高桥镇青年才郡13幢33号304室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","411421198907260167","411421198907260167","GJJ","","李丹丹","李丹丹","西河街68弄14号704");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227198611110772","330227198611110772","GJJ","","朱鼎挺","朱鼎挺","宁波市鄞州区首南街道四季云顶4幢18号2202室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330205196303090899","330205196303090899","GJJ","","周新岳","周新岳","槐树巷6号1105");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","445221198604241944","445221198604241944","GJJ","","彭丹丹","彭丹丹","胜丰路60弄2号103");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","62050319880625202X","62050319880625202X","GJJ","","刘娟弟","刘娟弟","广贤路1071号1902");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","320921197206235014","320921197206235014","GJJ","","石其楼","石其楼","五江湾(南区)5幢9号101");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33022619801107242X","33022619801107242X","GJJ","","林维芳","林维芳","兴宁巷83号721");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","430981198708168380","430981198708168380","GJJ","","陶凤云","陶凤云","华业街58弄10号603");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","331023198303177013","331023198303177013","GJJ","","许吉三","许吉三","宁波市鄞州区首南街道金色水岸3幢7号1603室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330822198808116917","330822198808116917","GJJ","","徐亮","徐亮","徐家漕路211弄25号506，阁楼");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330205198609131824","330205198609131824","GJJ","","孙懿霖","孙懿霖","天成家园3幢8号103");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","420583198403052829","420583198403052829","GJJ","","黄金莲","黄金莲","宁波市海曙区石碶街道城南公馆4幢9单元1212室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","440681197601150210","440681197601150210","GJJ","","廖麟辉","廖麟辉","慈湖人家西区21幢120号504，阁04");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","421126198407071180","421126198407071180","GJJ","","朱丹","朱丹","春晖佳苑19幢97号205");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330203197302021527","330203197302021527","GJJ","","葛红霞","葛红霞","宁波市鄞州区潘火街道香园37幢188号、宁波市鄞州区潘火街道香园37幢188号车库");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","522623198403190011","522623198403190011","GJJ","","邓顺民","邓顺民","园丁街88弄35号202");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330226199408190031","330226199408190031","GJJ","","施秋野","施秋野","南雅街9弄12号607");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330226199002180802","330226199002180802","GJJ","","徐玲燕","徐玲燕","东旺路12弄1幢3号503室等");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330126197007273712","330126197007273712","GJJ","","叶建仁","叶建仁","颐和名苑11幢59号902");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","332625196808196313","332625196808196313","GJJ","","叶贵武","叶贵武","北仑区小港长山路18号(浃江小区)14幢303室、北仑区小港长山路18号(浃江小区)14幢11号");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330224198103110013","330224198103110013","GJJ","","严静波","严静波","天成家园南区11幢51号802");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","152127197804302728","152127197804302728","GJJ","","潘兆荣","潘兆荣","兴宁路28号816");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330282199103132835","330282199103132835","GJJ","","蒋萧","蒋萧","宁波市鄞州区钟公庙街道悦江花苑1幢1号1702室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33028119841031198X","33028119841031198X","GJJ","","郑旭娟","郑旭娟","余姚市城区汇翠花园10幢808室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330225199104010322","330225199104010322","GJJ","","贾苗苗","贾苗苗","宁波市鄞州区中河街道天童北路1353号B408室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330483199009071623","330483199009071623","GJJ","","朱虹","朱虹","皇冠花园41号404");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","51112919851206221X","51112919851206221X","GJJ","","罗应灵","罗应灵","汇嘉新园21幢72号1602");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330219197401201006","330219197401201006","GJJ","","毛亚凤","毛亚凤","宁波市海曙区石碶街道枫景公寓5幢402室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330204199009031027","330204199009031027","GJJ","","李莉","李莉","宁波市鄞州区钟公庙街道广德里11幢16号2003室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330225198704290335","330225198704290335","GJJ","","梁亮","梁亮","东御花苑1号2604");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","342626199008252227","342626199008252227","GJJ","","程晓艺","程晓艺","紫园7幢11号202");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","33022719911118135X","33022719911118135X","GJJ","","徐鹤","徐鹤","惊驾名庭7幢17、18号2202");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227198712214415","330227198712214415","GJJ","","励冰冰","励冰冰","宁波市鄞州区钟公庙街道碧云天小区11幢22号1003室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330921199101026014","330921199101026014","GJJ","","吴泽昊","吴泽昊","朱雀新村48号303");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","622722198706242010","622722198706242010","GJJ","","王福涛","王福涛","钱湖人家84幢177号202");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330327199102067243","330327199102067243","GJJ","","章少林","章少林","宁波市鄞州区姜山镇晨光名苑4幢7号402室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330219197702196415","330219197702196415","GJJ","","沈红波","沈红波","宁波市海曙区高桥镇青年才郡5幢14号101室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227199009238241","330227199009238241","GJJ","","朱臻丽","朱臻丽","宁波市鄞州区钟公庙街道金庭茗苑13幢34.35号316室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330219197103136533","330219197103136533","GJJ","","李立新","李立新","宁波市海曙区高桥镇君尚城13幢28号1603室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330283198710227723","330283198710227723","GJJ","","邱萍萍","邱萍萍","宁波市鄞州区中河街道彩虹新村2幢207室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330227198511274411","330227198511274411","GJJ","","李技能","李技能","宁波市鄞州区姜山镇都市华庭24幢128号1610室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330211198211110027","330211198211110027","GJJ","","史敏","史敏","镇海区招宝山街道三层楼下1号1-3室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330283198310303723","330283198310303723","GJJ","","毛颖颖","毛颖颖","新天地东区2幢6号1506");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","420502198610151362","420502198610151362","GJJ","","胡安蕊","胡安蕊","东柳坊33幢102");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330206198301200025","330206198301200025","GJJ","","汪巧静","汪巧静","宁波市鄞州区首南街道风格首岸苑2幢6号1305室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","410781197902090442","410781197902090442","GJJ","","闫映春","闫映春","苍松路147弄2号803");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330211197608201512","330211197608201512","GJJ","","曹嵊东","曹嵊东","镇海区招宝山街道茗南路13号503室");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330203198805050922","330203198805050922","GJJ","","张丽雅","张丽雅","南大步巷18号607");
			httpURLConnectionPOST5907("其他-02491-000","其他-02491-001","不动产权证（房屋所有权证）","330821198410294581","330821198410294581","GJJ","","周晓霞","周晓霞","丽江新都1幢1号202");*/
		}
	}
}
