package com.yondervision.mi.test.wangting1qi;

import com.yondervision.mi.common.EncryptionByMD5;
import com.yondervision.mi.test.AesTest;
import com.yondervision.mi.util.security.RSASignature;
import org.apache.poi.util.SystemOutLogger;

import java.io.BufferedReader;
import java.io.DataOutputStream;
import java.io.InputStreamReader;
import java.net.HttpURLConnection;
import java.net.URL;
import java.net.UnknownHostException;
//宁波治安户籍迁出信息
public class HttpSend5972appapi00157 {
	public static final String POST_URL = "http://61.153.144.77:7006/YBMAPZH/";
	private static final String appKey_V = "b5b1c6938e5d0cef72457bd788ffdef0";
	private static final String appId_V = "yondervisionwebservice40";
	private static final String clientIp_V="172.10.0.1";

	public static String httpURLConnectionPOST5972(
			String certinum,
			String accname,
			String powerMatters,
			String subPowerMatters,
			String materialName,
			String gmsfhm) {
		try {
			long starTime=System.currentTimeMillis();
			URL url = new URL(POST_URL + "appapi00157.json");
			HttpURLConnection connection = (HttpURLConnection) url.openConnection();
			connection.setDoOutput(true);
			connection.setDoInput(true);
			connection.setRequestMethod("POST");
			connection.setUseCaches(false);
			connection.setInstanceFollowRedirects(true);
			connection.addRequestProperty("headpara","fullPara,centerId,channel");
			String userId = "330726198810170330";
			AesTest aes = null;
			try {
				aes = new AesTest();
			} catch (Exception e) {
				e.printStackTrace();
			}

		 String Para ="userId="+ userId+ "&usertype=10&deviceType=3&deviceToken=&currenVersion=1.0&buzType=5972&appid="
						+ appId_V+ "&appkey="+ appKey_V+ "&appToken=&clientIp="+clientIp_V+"&clientMAC=E8:39:35:A7:AC:58&brcCode=05740008&tranDate=2017-09-19&channelSeq="
						+ "&certinum="+certinum
						+ "&accname="+accname
						+ "&powerMatters="+powerMatters
						+ "&subPowerMatters="+subPowerMatters
						+ "&materialName="+materialName
						+"&gmsfhm="+gmsfhm;


			 String fullPara =aes.encrypt(Para.getBytes("UTF-8"));
			 // 用于数字签名
			String parm ="fullPara="+fullPara+"&centerId=00057400&channel=40";			
			// 用于发送http报文
			String parm1 ="fullPara="+ fullPara.replace("+", "%2B")+ "&AESFlag=1&centerId=00057400&channel=40";
			connection.addRequestProperty("headparaMD5", RSASignature.sign(EncryptionByMD5.getMD5(parm.getBytes()),RSASignature.RSA_PRIVATE));
			connection.setRequestProperty("Content-Type","application/x-www-form-urlencoded;charset=utf-8");
			connection.connect();
			DataOutputStream dataout = new DataOutputStream(connection.getOutputStream());
			dataout.writeBytes(parm1);
			dataout.flush();
			dataout.close();
			BufferedReader bf = new BufferedReader(new InputStreamReader(connection.getInputStream(), "UTF-8"));
			String line;
			StringBuilder sb = new StringBuilder();
			while ((line = bf.readLine()) != null) {
				sb.append(line).append(System.getProperty("line.separator"));
			} 
			bf.close();
			connection.disconnect(); 
			String result=aes.decrypt(sb.toString());
			System.out.println(result);
			long endTime=System.currentTimeMillis();
			long Time=endTime-starTime;
			System.out.println("请求大数据平台耗时"+Time+"毫秒");
			return result;
		} catch (Exception e) {
			e.printStackTrace();
			return "";
		}
	}

    /*private static String change(String input) {
    	String output = null;
        try {
            output = new String(input.getBytes("iso-8859-1"),"utf-8");
        } catch (UnsupportedEncodingException e) {
            e.printStackTrace();
        }
		return output;
    }  */

	public static void main(String[] args) throws UnknownHostException {
			//for (int i = 1; i < 2; i++) {

/*
		httpURLConnectionPOST5972("330281198512032527","张滕馨","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330281198512032527");
		httpURLConnectionPOST5972("110108196703290024","孙学红","其他-02491-000","其他-02491-005","出境定居提取住房公积金","110108196703290024");
		httpURLConnectionPOST5972("330227199310122731","周明铭","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33020419881110601X");
*/

		httpURLConnectionPOST5972("330726198810170330","张鹏程","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330726198810170330");
		httpURLConnectionPOST5972("330225198711270025","王玲娜","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330225198711270025");


//		httpURLConnectionPOST5972("330281198512032527","白晨博","其他-02491-000","其他-02491-005","出境定居提取住房公积金","61040419720306055X");
//		httpURLConnectionPOST5972("110108196703290024","包亚萍","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330203196812202729");
//		httpURLConnectionPOST5972("33032719760505439X","包雨乐","其他-02491-000","其他-02491-005","出境定居提取住房公积金","320621198812278311");
//		httpURLConnectionPOST5972("330281198512032527","包云明","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330205197511190311");
//		httpURLConnectionPOST5972("110108196703290024","鲍红霞","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330226198006277084");
//		httpURLConnectionPOST5972("33032719760505439X","鲍先军","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330226197509137679");
//		httpURLConnectionPOST5972("330281198512032527","鲍徐超","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330281199101163332");
//		httpURLConnectionPOST5972("110108196703290024","贝建玲","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330205196904170624");
//		httpURLConnectionPOST5972("33032719760505439X","贝丽琴","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330204196411213028");
//		httpURLConnectionPOST5972("330281198512032527","蔡利亚","其他-02491-000","其他-02491-005","出境定居提取住房公积金","331082198402044267");
//		httpURLConnectionPOST5972("110108196703290024","蔡敏强","其他-02491-000","其他-02491-005","出境定居提取住房公积金","332529195904220016");
//		httpURLConnectionPOST5972("33032719760505439X","蔡怡颖","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33020419731011202X");
//		httpURLConnectionPOST5972("330281198512032527","曹爱华","其他-02491-000","其他-02491-005","出境定居提取住房公积金","320922196309045725");
//		httpURLConnectionPOST5972("110108196703290024","曹叶婷","其他-02491-000","其他-02491-005","出境定居提取住房公积金","350823199404163420");
//		httpURLConnectionPOST5972("33032719760505439X","曹震明","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33020319681105092X");
//		httpURLConnectionPOST5972("330281198512032527","岑积良","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222195902151958");
//		httpURLConnectionPOST5972("110108196703290024","岑立微","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222197308234688");
//		httpURLConnectionPOST5972("33032719760505439X","岑松华","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33022219581027001X");
//		httpURLConnectionPOST5972("330281198512032527","柴建国","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330203195901171819");
//		httpURLConnectionPOST5972("110108196703290024","陈白静","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33021119681106204X");
//		httpURLConnectionPOST5972("33032719760505439X","陈柏权","其他-02491-000","其他-02491-005","出境定居提取住房公积金","450881198605102539");
//		httpURLConnectionPOST5972("330281198512032527","陈丹丹","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330624198707174984");
//		httpURLConnectionPOST5972("110108196703290024","陈公一","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222195811200013");
//		httpURLConnectionPOST5972("33032719760505439X","陈乖恩","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330224196810094324");
//		httpURLConnectionPOST5972("330281198512032527","陈国南","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330211195903014518");
//		httpURLConnectionPOST5972("110108196703290024","陈国荣","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330202195512070014");
//		httpURLConnectionPOST5972("33032719760505439X","陈国燕","其他-02491-000","其他-02491-005","出境定居提取住房公积金","332528198605281422");
//		httpURLConnectionPOST5972("330281198512032527","陈海刚","其他-02491-000","其他-02491-005","出境定居提取住房公积金","331081198810259439");
//		httpURLConnectionPOST5972("110108196703290024","陈海岩","其他-02491-000","其他-02491-005","出境定居提取住房公积金","411302198204114214");
//		httpURLConnectionPOST5972("33032719760505439X","陈宏玉","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330227197112228528");
//		httpURLConnectionPOST5972("330281198512032527","陈黄龙","其他-02491-000","其他-02491-005","出境定居提取住房公积金","362323199103016511");
//		httpURLConnectionPOST5972("110108196703290024","陈辉娟","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330224197902086027");
//		httpURLConnectionPOST5972("33032719760505439X","陈慧英","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330227197401084444");
//		httpURLConnectionPOST5972("330281198512032527","陈际伟","其他-02491-000","其他-02491-005","出境定居提取住房公积金","431226198512014812");
//		httpURLConnectionPOST5972("110108196703290024","陈佳伟","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33028219900518691X");
//		httpURLConnectionPOST5972("33032719760505439X","陈家敏","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330226199206052394");
//		httpURLConnectionPOST5972("330281198512032527","陈建群","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222196909276926");
//		httpURLConnectionPOST5972("110108196703290024","陈江洋","其他-02491-000","其他-02491-005","出境定居提取住房公积金","42032119830917247X");
//		httpURLConnectionPOST5972("33032719760505439X","陈凯霞","其他-02491-000","其他-02491-005","出境定居提取住房公积金","620121199012142828");
//		httpURLConnectionPOST5972("330281198512032527","陈科丹","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330282198202072845");
//		httpURLConnectionPOST5972("110108196703290024","陈科技","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330203198705103011");
//		httpURLConnectionPOST5972("33032719760505439X","陈利良","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33022219801023863X");
//		httpURLConnectionPOST5972("330281198512032527","陈林亭","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330224196604094526");
//		httpURLConnectionPOST5972("110108196703290024","陈明辉","其他-02491-000","其他-02491-005","出境定居提取住房公积金","43068219900501622X");
//		httpURLConnectionPOST5972("33032719760505439X","陈明亮","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330224196102120077");
//		httpURLConnectionPOST5972("330281198512032527","陈铭辉","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330227196812017364");
//		httpURLConnectionPOST5972("110108196703290024","陈强苗","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222195804170012");
//		httpURLConnectionPOST5972("33032719760505439X","陈赛琴","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330227196901128525");
//		httpURLConnectionPOST5972("330281198512032527","陈胜楠","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330226199206112414");
//		httpURLConnectionPOST5972("110108196703290024","陈盛益","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330225199501317715");
//		httpURLConnectionPOST5972("33032719760505439X","陈淑萍","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330205196811130025");
//		httpURLConnectionPOST5972("330281198512032527","陈苏琴","其他-02491-000","其他-02491-005","出境定居提取住房公积金","332626196812120764");
//		httpURLConnectionPOST5972("110108196703290024","陈素素","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330327199112175168");
//		httpURLConnectionPOST5972("33032719760505439X","陈伟伟","其他-02491-000","其他-02491-005","出境定居提取住房公积金","340822198411075215");
//		httpURLConnectionPOST5972("330281198512032527","陈文君","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33022219591202002X");
//		httpURLConnectionPOST5972("110108196703290024","陈先君","其他-02491-000","其他-02491-005","出境定居提取住房公积金","370786198206170039");
//		httpURLConnectionPOST5972("33032719760505439X","陈小军","其他-02491-000","其他-02491-005","出境定居提取住房公积金","422301197905017611");
//		httpURLConnectionPOST5972("330281198512032527","陈学双","其他-02491-000","其他-02491-005","出境定居提取住房公积金","342423198805098379");
//		httpURLConnectionPOST5972("110108196703290024","陈雪丽","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330206198202143424");
//		httpURLConnectionPOST5972("33032719760505439X","陈雪平","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330211196901313025");
//		httpURLConnectionPOST5972("330281198512032527","陈雪珍","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33022219631128004X");
//		httpURLConnectionPOST5972("110108196703290024","陈雅玲","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330203196312100646");
//		httpURLConnectionPOST5972("33032719760505439X","陈艳芳","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330203196902232120");
//		httpURLConnectionPOST5972("330281198512032527","陈叶知","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330204198902091028");
//		httpURLConnectionPOST5972("110108196703290024","陈煜煜","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330282198210208642");
//		httpURLConnectionPOST5972("33032719760505439X","陈照银","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33022519641216803X");
//		httpURLConnectionPOST5972("330281198512032527","陈忠菊","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330227196310044266");
//		httpURLConnectionPOST5972("110108196703290024","程兵兵","其他-02491-000","其他-02491-005","出境定居提取住房公积金","340828197909070132");
//		httpURLConnectionPOST5972("33032719760505439X","程国威","其他-02491-000","其他-02491-005","出境定居提取住房公积金","410923198809200012");
//		httpURLConnectionPOST5972("330281198512032527","程洪琼","其他-02491-000","其他-02491-005","出境定居提取住房公积金","510321198001037046");
//		httpURLConnectionPOST5972("110108196703290024","程慧敏","其他-02491-000","其他-02491-005","出境定居提取住房公积金","340223199005120517");
//		httpURLConnectionPOST5972("33032719760505439X","程玲慧","其他-02491-000","其他-02491-005","出境定居提取住房公积金","360429197708270021");
//		httpURLConnectionPOST5972("330281198512032527","程振理","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330225196506290036");
//		httpURLConnectionPOST5972("110108196703290024","仇雅萍","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330204196901014021");
//		httpURLConnectionPOST5972("33032719760505439X","褚春英","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330219197603144986");
//		httpURLConnectionPOST5972("330281198512032527","戴光英","其他-02491-000","其他-02491-005","出境定居提取住房公积金","510228197808263348");
//		httpURLConnectionPOST5972("110108196703290024","戴海龙","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330203195904010017");
//		httpURLConnectionPOST5972("33032719760505439X","戴利云","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222196811163229");
//		httpURLConnectionPOST5972("330281198512032527","戴明良","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330205195901183353");
//		httpURLConnectionPOST5972("110108196703290024","戴佩君","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330211197001171580");
//		httpURLConnectionPOST5972("33032719760505439X","戴水宏","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330227195903117892");
//		httpURLConnectionPOST5972("330281198512032527","单一枫","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330281199301023350");
//		httpURLConnectionPOST5972("110108196703290024","丁爱武","其他-02491-000","其他-02491-005","出境定居提取住房公积金","220621198505121118");
//		httpURLConnectionPOST5972("33032719760505439X","丁素亚","其他-02491-000","其他-02491-005","出境定居提取住房公积金","331022198108141860");
//		httpURLConnectionPOST5972("330281198512032527","丁喜欢","其他-02491-000","其他-02491-005","出境定居提取住房公积金","432325197911229023");
//		httpURLConnectionPOST5972("110108196703290024","丁亚妙","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330226197410092562");
//		httpURLConnectionPOST5972("33032719760505439X","董海波","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33020319690401002X");
//		httpURLConnectionPOST5972("330281198512032527","董小媚","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330781198607063681");
//		httpURLConnectionPOST5972("110108196703290024","董志梅","其他-02491-000","其他-02491-005","出境定居提取住房公积金","33022419690207008X");
//		httpURLConnectionPOST5972("33032719760505439X","杜彩萍","其他-02491-000","其他-02491-005","出境定居提取住房公积金","371122198809111827");
//		httpURLConnectionPOST5972("330281198512032527","樊娜慧","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330282199008109186");
//		httpURLConnectionPOST5972("110108196703290024","方爱忠","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222195901112834");
//		httpURLConnectionPOST5972("33032719760505439X","方冬儿","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222197501141221");
//		httpURLConnectionPOST5972("330281198512032527","方国芬","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330227196901103029");
//		httpURLConnectionPOST5972("110108196703290024","方宏雷","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330282198412112833");
//		httpURLConnectionPOST5972("33032719760505439X","方文玲","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330222196210088921");
//		httpURLConnectionPOST5972("330281198512032527","方毅俊","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330127198301223418");
//		httpURLConnectionPOST5972("110108196703290024","冯福彩","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330226196507280020");
//		httpURLConnectionPOST5972("33032719760505439X","冯国强","其他-02491-000","其他-02491-005","出境定居提取住房公积金","612429199204147858");
//		httpURLConnectionPOST5972("330281198512032527","冯晓敏","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330203196401152149");
//		httpURLConnectionPOST5972("110108196703290024","冯振刚","其他-02491-000","其他-02491-005","出境定居提取住房公积金","341226198601203517");
//		httpURLConnectionPOST5972("33032719760505439X","符玲妹","其他-02491-000","其他-02491-005","出境定居提取住房公积金","460031198310285221");
//		httpURLConnectionPOST5972("330281198512032527","付平安","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330281198206190017");
//		httpURLConnectionPOST5972("110108196703290024","傅国平","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330203195904101218");
//		httpURLConnectionPOST5972("33032719760505439X","傅健军","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330227197211152039");
//		httpURLConnectionPOST5972("330281198512032527","傅珉娜","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330206196407031726");
//		httpURLConnectionPOST5972("110108196703290024","傅彦霖","其他-02491-000","其他-02491-005","出境定居提取住房公积金","330902199112101017");




		/*long starTime=System.currentTimeMillis();
				long endTime=System.currentTimeMillis();
				long Time=endTime-starTime;
				System.out.println("请求大数据平台耗时"+Time+"毫秒");*/
			//}
	}
}
