package com.yondervision.mi.test;

import com.yd.util.FileUtil;

import java.io.File;
import java.util.UUID;

public class AppApi00341test {

    public static void main(String[] args) {
       /* String voucherData = "icount=1&certinum=330224197903151441&userid=stgy&channel=10&centerId=00057400&inaccdate=2021-01-19&zy=统发&begym=202101&payamt=5540.00&bal=5540.00," +
                "icount=2&certinum=330224197903151441&userid=stgy&channel=10&centerId=00057400&inaccdate=2021-01-19&zy=统发&begym=202101&payamt=4617.00&bal=4617.00" +
                "icount=3&certinum=330224197903151441&userid=stgy&channel=10&centerId=00057400&inaccdate=2020-12-18&zy=统发&begym=202012&payamt=5540.00&bal=5540.00";*/
        //String voucherData = "[{\"table1\":[\"1~SL00122020001191~张杰~330283198802270017~2021-03-10~261902.20~23502.20~202.20~2802.20~502.20~592.20~罚息\",\"1~SL00122020001191~富迪~330283198802270017~2021-03-10~261902.20~23502.20~202.20~2802.20~502.20~592.20~罚息\",\"1~SL00122020001191~晓晴~330283198802270017~2021-03-16~261902.20~23502.28~202.20~2802.29~502.20~592.20~罚息\"]}]";
        //String voucherData = "[{\"table1\":[\"1~2021-02-22~统发~202102~3432.00~261902.20~统一\",\"1~2021-02-22~统发~202102~3432.00~261902.20~261902.28\"]}]";
        //String voucherData = "[{\"table1\":[\"1~SL00122020001191~张杰~330283198802270017~2021-03-10~261902.20~23502.20\",\"202.20~2802.20~502.20~592.20~罚息\",\"1~SL00122020001191~富迪~330283198802270017~2021-03-10~261902.20~23502.20\",\"202.20~2802.20~502.20~592.20~罚息\"]}]";
        String voucherData = "[{\"certinum\":\"330726198810170330\",\"accname\":\"张鹏程\",\"loancontrnum\":\"2014004900\",\"table1\":[\"1~2020-09-21~0.00~0.00~711.39~0.00~0.00~0.00~银行代扣\",\"2~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"3~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"4~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"5~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"6~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\"," +
                "\"7~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"8~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"9~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"10~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"11~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"12~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"13~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"14~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",\"15~2020-09-21~262068.90~ 599.78~0.00~0.00~0.00~0.00~银行代扣\",]}]" ;
        File pdfFile = null;
        String templateName = "grhkmxcs2.doc";//模板文件名
        String templatePath = "D:\\工作文档\\我做的接口-新接口开发\\个人还款明细查询接口\\模板\\pdf\\";
        File docFile = FileUtil.createWord(templatePath + templateName, new File("D:\\工作文档\\我做的接口-新接口开发\\个人还款明细查询接口\\模板\\pdf\\",  UUID.randomUUID().toString()  + ".doc"), voucherData);
        pdfFile = FileUtil.wordToPdf(docFile, new File("D:\\工作文档\\我做的接口-新接口开发\\个人还款明细查询接口\\模板\\pdf\\",  UUID.randomUUID().toString() + ".pdf"));


    }
}
